Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.0.31/atdf/ATSAML10D14A.atdf
        <register name="AHBMASK" offset="0x10" rw="RW" size="4" initval="0x00001FFF" caption="AHB Mask">
          <bitfield name="APBA_" caption="AHB-APB Bridge A AHB Clock Mask" mask="0x1"/>
          <bitfield name="APBB_" caption="AHB-APB Bridge B AHB Clock Mask" mask="0x2"/>
          <bitfield name="APBC_" caption="AHB-APB Bridge C AHB Clock Mask" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC AHB Clock Mask" mask="0x8"/>
          <bitfield name="DSU_" caption="DSU AHB Clock Mask" mask="0x10"/>
          <bitfield name="PAC_" caption="PAC AHB Clock Mask" mask="0x40"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL AHB Clock Mask" mask="0x80"/>
          <bitfield name="TRAM_" caption="TRAM AHB Clock Mask" mask="0x1000"/>
        </register>
        <register name="APBAMASK" offset="0x14" rw="RW" size="4" initval="0x00007FFF" caption="APBA Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Clock Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Clock Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Clock Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Clock Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Clock Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Clock Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Clock Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Clock Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Clock Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Clock Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Clock Enable" mask="0x800"/>
          <bitfield name="PORT_" caption="PORT APB Clock Enable" mask="0x1000"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x2000"/>
        </register>
        <register name="APBBMASK" offset="0x18" rw="RW" size="4" initval="0x00000017" caption="APBB Mask">
          <bitfield name="IDAU_" caption="IDAU APB Clock Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Clock Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Clock Enable" mask="0x4"/>
          <bitfield name="HMATRIXS_" caption="HMATRIXHS APBB Clock Enable" mask="0x10"/>
        </register>
        <register name="APBCMASK" offset="0x1C" rw="RW" size="4" initval="0x00001FFF" caption="APBC Mask">
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Clock Enable" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Clock Enable" mask="0x4"/>
          <bitfield name="TC0_" caption="TC0 APB Clock Enable" mask="0x10"/>
          <bitfield name="TC1_" caption="TC1 APB Clock Enable" mask="0x20"/>
          <bitfield name="TC2_" caption="TC2 APB Clock Enable" mask="0x40"/>
          <bitfield name="ADC_" caption="ADC APB Clock Enable" mask="0x80"/>
          <bitfield name="DAC_" caption="DAC APB Clock Enable" mask="0x100"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x200"/>
          <bitfield name="TRNG_" caption="TRNG APB Clock Enable" mask="0x400"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x800"/>
          <bitfield name="OPAMP_" caption="OPAMP APB Clock Enable" mask="0x1000"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="NVMCTRL" id="U2802" version="1.0.0" caption="Non-Volatile Memory Controller">
      <register-group name="NVMCTRL" caption="Non-Volatile Memory Controller">
        <register name="CTRLA" offset="0x0" rw="W" size="2" initval="0x0000" caption="Control A">
          <bitfield name="CMD" caption="Command" mask="0x7F" values="NVMCTRL_CTRLA__CMD"/>
          <bitfield name="CMDEX" caption="Command Execution" mask="0xFF00" values="NVMCTRL_CTRLA__CMDEX"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B">
          <bitfield name="RWS" caption="NVM Read Wait States" mask="0x1E"/>
          <bitfield name="SLEEPPRM" caption="Power Reduction Mode during Sleep" mask="0x300" values="NVMCTRL_CTRLB__SLEEPPRM"/>
          <bitfield name="FWUP" caption="fast wake-up" mask="0x800"/>
          <bitfield name="READMODE" caption="NVMCTRL Read Mode" mask="0x30000" values="NVMCTRL_CTRLB__READMODE"/>
          <bitfield name="CACHEDIS" caption="Cache Disable" mask="0x40000"/>
        </register>
        <register name="CTRLC" offset="0x8" rw="RW" size="1" initval="0x01" caption="Control C">
          <bitfield name="MANW" caption="Manual Write" mask="0x1"/>
        </register>
        <register name="EVCTRL" offset="0xA" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="AUTOWEI" caption="Auto Write Event Enable" mask="0x1"/>
          <bitfield name="AUTOWINV" caption="Auto Write Event Polarity Inverted" mask="0x2"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="DONE" caption="NVM Done Interrupt Clear" mask="0x1"/>
          <bitfield name="PROGE" caption="Programming Error Status Interrupt Clear" mask="0x2"/>
          <bitfield name="LOCKE" caption="Lock Error Status Interrupt Clear" mask="0x4"/>
          <bitfield name="NVME" caption="NVM Error Interrupt Clear" mask="0x8"/>
          <bitfield name="KEYE" caption="Key Write Error Interrupt Clear" mask="0x10"/>
          <bitfield name="NSCHK" caption="NS configuration change detected Interrupt Clear" mask="0x20"/>
        </register>
