Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.0.31/atdf/ATSAML10D14A.atdf
      <value-group name="TC_CTRLA__PRESCALER">
        <value name="DIV1" caption="Prescaler: GCLK_TC" value="0"/>
        <value name="DIV2" caption="Prescaler: GCLK_TC/2" value="1"/>
        <value name="DIV4" caption="Prescaler: GCLK_TC/4" value="2"/>
        <value name="DIV8" caption="Prescaler: GCLK_TC/8" value="3"/>
        <value name="DIV16" caption="Prescaler: GCLK_TC/16" value="4"/>
        <value name="DIV64" caption="Prescaler: GCLK_TC/64" value="5"/>
        <value name="DIV256" caption="Prescaler: GCLK_TC/256" value="6"/>
        <value name="DIV1024" caption="Prescaler: GCLK_TC/1024" value="7"/>
      </value-group>
      <value-group name="TC_CTRLA__PRESCSYNC">
        <value name="GCLK" caption="Reload or reset the counter on next generic clock" value="0"/>
        <value name="PRESC" caption="Reload or reset the counter on next prescaler clock" value="1"/>
        <value name="RESYNC" caption="Reload or reset the counter on next generic clock and reset the prescaler counter" value="2"/>
      </value-group>
      <value-group name="TC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force a stop" value="2"/>
        <value name="UPDATE" caption="Force update of double-buffered register" value="3"/>
        <value name="READSYNC" caption="Force a read synchronization of COUNT" value="4"/>
      </value-group>
      <value-group name="TC_EVCTRL__EVACT">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or retrigger TC on event" value="1"/>
        <value name="COUNT" caption="Count on event" value="2"/>
        <value name="START" caption="Start TC on event" value="3"/>
        <value name="STAMP" caption="Time stamp capture" value="4"/>
        <value name="PPW" caption="Period catured in CC0, pulse width in CC1" value="5"/>
        <value name="PWP" caption="Period catured in CC1, pulse width in CC0" value="6"/>
        <value name="PW" caption="Pulse width capture" value="7"/>
      </value-group>
      <value-group name="TC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal frequency" value="0"/>
        <value name="MFRQ" caption="Match frequency" value="1"/>
        <value name="NPWM" caption="Normal PWM" value="2"/>
        <value name="MPWM" caption="Match PWM" value="3"/>
      </value-group>
    </module>
    <module name="TRAM" id="U2801" version="1.0.0" caption="TrustRAM">
      <register-group name="TRAM" caption="TrustRAM">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="TAMPERS" caption="Tamper Erase" mask="0x10"/>
          <bitfield name="DRP" caption="Data Remanence Prevention" mask="0x40"/>
          <bitfield name="SILACC" caption="Silent Access" mask="0x80"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="RAMINV" caption="RAM Inversion Bit" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ongoing" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
        </register>
        <register name="DSCC" offset="0xC" rw="W" size="4" initval="0x00000000" caption="Data Scramble Control">
          <bitfield name="DSCKEY" caption="Data Scramble Key" mask="0x3FFFFFFF"/>
          <bitfield name="DSCEN" caption="Data Scramble Enable" mask="0x80000000"/>
        </register>
        <register name="PERMW" offset="0x10" rw="W" size="1" initval="0x00" caption="Permutation Write">
          <bitfield name="DATA" caption="Permutation Scrambler Data Input" mask="0x7"/>
        </register>
        <register name="PERMR" offset="0x11" rw="R" size="1" initval="0x00" caption="Permutation Read">
          <bitfield name="DATA" caption="Permutation Scrambler Data Output" mask="0x7"/>
        </register>
        <register name="RAM" offset="0x100" rw="RW" size="4" count="64" initval="0x00000000" caption="TrustRAM">
          <bitfield name="DATA" caption="Trust RAM Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="TRNG" id="U2242" version="1.2.0" caption="True Random Generator">
      <register-group name="TRNG" caption="True Random Generator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
